rails_project/app/controllers/users/registrations_controller.rb

  def set_current_user_employee
    @aktualny = current_user.employee if current_user.present?
---
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]