rails_project/app/views/employees/_form.html.erb

SELECT "departments".* FROM "departments"
---
    <%= form.label :Dział, style: "display: block; color: white;" %>
    <%= form.collection_select :department_id, Department.all, :id, :department_name, prompt: "Wybierz dział" , style: "background-color: ##db1212;"%>