rails_project/app/views/employees/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
</div>
<% unless @employees.any? { |employee| employee.user == current_user } %>