rails_project/app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments"
---
  def index
    @departments = Department.all

SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def aktualny
    @aktualny = current_user.employee if current_user.present?

INSERT INTO "departments" ("department_name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["department_name", "Pomocy Technicznej"], ["created_at", "2024-01-20 15:15:37.681194"], ["updated_at", "2024-01-20 15:15:37.681194"]]
---
  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save

DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", 1]]
---
  def destroy
    @department.destroy!

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_department
      @department = Department.find(params[:id])