rails_project/app/controllers/employees_controller.rb

  def aktualny
    @aktualny = current_user.employee if current_user.present?
---
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "created_at", "updated_at", "department_id", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["first_name", "Mate"], ["last_name", "pat"], ["created_at", "2024-01-20 15:16:32.680520"], ["updated_at", "2024-01-20 15:16:32.680520"], ["department_id", 1], ["user_id", 1]]

  def destroy
    @employee.destroy!
---
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 6]]

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]