rails_project/app/controllers/home_controller.rb

  def aktualny
    @aktualny = current_user.employee if current_user.present?
---
SELECT "employees".* FROM "employees" WHERE "employees"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]