rails_project/app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
  def index
    @tickets = Ticket.all

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_reporter
      # Znajdź obiekt Employee na podstawie employee_id związanego z aktualnym Ticket
      @reporter = Employee.find_by(id: @ticket.employee_id)

INSERT INTO "tickets" ("status", "description", "image", "created_at", "updated_at", "employee_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["status", "Nowy"], ["description", "wqdqw"], ["image", "<0 bytes of binary data>"], ["created_at", "2024-01-20 15:18:40.413028"], ["updated_at", "2024-01-20 15:18:40.413028"], ["employee_id", 2]]
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

UPDATE "tickets" SET "status" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["status", "Rozwiazywanie"], ["updated_at", "2024-01-20 20:23:56.362922"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @ticket.update(ticket_params)

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 2]]
---
  def destroy
    @ticket.destroy!

SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_ticket
      @ticket = Ticket.find(params[:id])