rails_project/app/views/tickets/_ticket.html.erb

    <tr>
      <td><%= @emp.find(ticket.employee_id).first_name %></td>
      <td><%= @emp.find(ticket.employee_id).last_name %></td>
       <td><%= @user.find(@emp.find(ticket.employee_id).user_id).email %></td>
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]