rails_project/app/views/tickets/index.html.erb

INSERT INTO "employees_tickets" ("employee_id", "ticket_id") VALUES (?, ?)  [["employee_id", 2], ["ticket_id", 1]]
---

        <% @employees_tickets.create(employee_id: ticket.employee_id, ticket_id: ticket.id) %>